#### Terraform Plan Results for `asg-1`

<details><summary>Show Plan</summary>

```diff
[command]/home/runner/work/_temp/8a524e42-2139-4b07-99b9-67ba42457025/terraform-bin plan -no-color -out=tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.asg.aws_autoscaling_group.this will be created
  + resource "aws_autoscaling_group" "this" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 2
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "EC2"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 4
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = "test-asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = [
          + "subnet-004c314f965ff4a14",
          + "subnet-0ff7ef2b7250432d7",
        ]
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + instance_refresh {
          + strategy = "Rolling"

          + preferences {
              + max_healthy_percentage       = 100
              + min_healthy_percentage       = 50
              + scale_in_protected_instances = "Ignore"
              + skip_matching                = false
              + standby_instances            = "Ignore"
            }
        }

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "dev"
        }
      + tag {
          + key                 = "Managed_by"
          + propagate_at_launch = true
          + value               = "terraform"
        }
      + tag {
          + key                 = "Project"
          + propagate_at_launch = true
          + value               = "dev-project"
        }
    }

  # module.launch_template.aws_launch_template.this will be created
  + resource "aws_launch_template" "this" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + description     = "Launch template for development environment"
      + id              = (known after apply)
      + image_id        = "ami-0f58b397bc5c1f2e8"
      + instance_type   = "t2.micro"
      + key_name        = "aes"
      + latest_version  = (known after apply)
      + name            = "dev-app-template"
      + name_prefix     = (known after apply)
      + tags            = {
          + "Environment" = "dev"
          + "Managed_by"  = "terraform"
          + "Name"        = "dev-app-template"
          + "Project"     = "dev-project"
        }
      + tags_all        = {
          + "Environment" = "dev"
          + "Managed_by"  = "terraform"
          + "Name"        = "dev-app-template"
          + "Project"     = "dev-project"
        }

      + monitoring {
          + enabled = true
        }

      + network_interfaces {
          + associate_public_ip_address = "true"
          + security_groups             = [
              + "sg-0db9e6c20711ab0bd",
            ]
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Environment" = "dev"
              + "Managed_by"  = "terraform"
              + "Name"        = "dev-app-template-instance"
              + "Project"     = "dev-project"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Environment" = "dev"
              + "Managed_by"  = "terraform"
              + "Name"        = "dev-app-template-volume"
              + "Project"     = "dev-project"
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + asg_details             = {
      + arn  = (known after apply)
      + id   = (known after apply)
      + name = "test-asg"
    }
  + launch_template_details = {
      + id             = (known after apply)
      + latest_version = (known after apply)
      + name           = "dev-app-template"
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.asg.aws_autoscaling_group.this will be created%0A  + resource "aws_autoscaling_group" "this" {%0A      + arn                              = (known after apply)%0A      + availability_zones               = (known after apply)%0A      + default_cooldown                 = (known after apply)%0A      + desired_capacity                 = 2%0A      + force_delete                     = false%0A      + force_delete_warm_pool           = false%0A      + health_check_grace_period        = 300%0A      + health_check_type                = "EC2"%0A      + id                               = (known after apply)%0A      + ignore_failed_scaling_activities = false%0A      + load_balancers                   = (known after apply)%0A      + max_size                         = 4%0A      + metrics_granularity              = "1Minute"%0A      + min_size                         = 1%0A      + name                             = "test-asg"%0A      + name_prefix                      = (known after apply)%0A      + predicted_capacity               = (known after apply)%0A      + protect_from_scale_in            = false%0A      + service_linked_role_arn          = (known after apply)%0A      + target_group_arns                = (known after apply)%0A      + vpc_zone_identifier              = [%0A          + "subnet-004c314f965ff4a14",%0A          + "subnet-0ff7ef2b7250432d7",%0A        ]%0A      + wait_for_capacity_timeout        = "10m"%0A      + warm_pool_size                   = (known after apply)%0A%0A      + instance_refresh {%0A          + strategy = "Rolling"%0A%0A          + preferences {%0A              + max_healthy_percentage       = 100%0A              + min_healthy_percentage       = 50%0A              + scale_in_protected_instances = "Ignore"%0A              + skip_matching                = false%0A              + standby_instances            = "Ignore"%0A            }%0A        }%0A%0A      + launch_template {%0A          + id      = (known after apply)%0A          + name    = (known after apply)%0A          + version = "$Latest"%0A        }%0A%0A      + tag {%0A          + key                 = "Environment"%0A          + propagate_at_launch = true%0A          + value               = "dev"%0A        }%0A      + tag {%0A          + key                 = "Managed_by"%0A          + propagate_at_launch = true%0A          + value               = "terraform"%0A        }%0A      + tag {%0A          + key                 = "Project"%0A          + propagate_at_launch = true%0A          + value               = "dev-project"%0A        }%0A    }%0A%0A  # module.launch_template.aws_launch_template.this will be created%0A  + resource "aws_launch_template" "this" {%0A      + arn             = (known after apply)%0A      + default_version = (known after apply)%0A      + description     = "Launch template for development environment"%0A      + id              = (known after apply)%0A      + image_id        = "ami-0f58b397bc5c1f2e8"%0A      + instance_type   = "t2.micro"%0A      + key_name        = "aes"%0A      + latest_version  = (known after apply)%0A      + name            = "dev-app-template"%0A      + name_prefix     = (known after apply)%0A      + tags            = {%0A          + "Environment" = "dev"%0A          + "Managed_by"  = "terraform"%0A          + "Name"        = "dev-app-template"%0A          + "Project"     = "dev-project"%0A        }%0A      + tags_all        = {%0A          + "Environment" = "dev"%0A          + "Managed_by"  = "terraform"%0A          + "Name"        = "dev-app-template"%0A          + "Project"     = "dev-project"%0A        }%0A%0A      + monitoring {%0A          + enabled = true%0A        }%0A%0A      + network_interfaces {%0A          + associate_public_ip_address = "true"%0A          + security_groups             = [%0A              + "sg-0db9e6c20711ab0bd",%0A            ]%0A        }%0A%0A      + tag_specifications {%0A          + resource_type = "instance"%0A          + tags          = {%0A              + "Environment" = "dev"%0A              + "Managed_by"  = "terraform"%0A              + "Name"        = "dev-app-template-instance"%0A              + "Project"     = "dev-project"%0A            }%0A        }%0A      + tag_specifications {%0A          + resource_type = "volume"%0A          + tags          = {%0A              + "Environment" = "dev"%0A              + "Managed_by"  = "terraform"%0A              + "Name"        = "dev-app-template-volume"%0A              + "Project"     = "dev-project"%0A            }%0A        }%0A    }%0A%0APlan: 2 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + asg_details             = {%0A      + arn  = (known after apply)%0A      + id   = (known after apply)%0A      + name = "test-asg"%0A    }%0A  + launch_template_details = {%0A      + id             = (known after apply)%0A      + latest_version = (known after apply)%0A      + name           = "dev-app-template"%0A    }%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tfplan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tfplan"%0A
::debug::stderr: 
::debug::exitcode: 0
```

</details>

* Plan generated at: `2025-02-02T13:04:48.572Z`
* Pushed by: @abhijeetpoonia
* Action: `repository_dispatch`